import pandas as pd
col = ['도서명', '저자', '출판연도', '가격', '판매부수']
data = [
    ['파이썬_입문', '김철수', 2018, 30000, 1500],
    ['데이터 사이언스', '이영희', 2020, 45000 , 1200],
    ['머신러닝 완벽 가이드', '박민수', 2019, 50000, 800],
    ['딥러닝 실습', '정소영', 2021, 55000, 600],
    ['웹 개발 기본', '최민호', 2017, 35000, 2000]
]

df = pd.DataFrame(data, columns=col)

d = {"도서명":["파이썬 입문","데이터 사이언스","머신러닝 완벽 가이드","딥러닝 실습","웹 개발 기본"],
     "저자":["김철수","이영희","박민수","정소영","최민호"],
     "출판연도":[2018,2020,2019,2021,2017],
     "가격":[30000,45000,50000,55000,35000],
     "판매부수":[1500,1200,800,600,2000]}
df2 = pd.DataFrame(d)


print(df)
print("------------------")
# 인덱스 지정
df.index = ["B1","B2","B3","B4","B5"]
print(df)
print("------------------")

# 카테고리 컬럼 추가
df["카테고리"] = ["프로그래밍", "데이터", "AI", "AI", "웹"]
print(df)
print("------------------")

# 인덱스 'B3' 제거
df_drop1 = df.drop(index="B3")
print(df_drop1)
print("------------------")

# 저자 열 제거
df_drop2 = df.drop(columns="저자")
print(df_drop2)
print("------------------")

# 인덱스 'B5'와 '판매부수' 열 동시에 제거
df_drop3 = df.drop(index="B5", columns="판매부수")
print(df_drop3)
print("------------------")

# 2019년 이후 출판된 도서
print(df[df["출판연도"] >= 2019])
print("------------------")

# 총매출 컬럼 추가
df["총매출"] = df["가격"] * df["판매부수"]
print(df)
print("------------------")

# 가격내림차순 상위 3권
# df_sort = df.sort_values(by="가격", ascending=False).head(3)
df_sort = df.sort_values(by="가격", ascending=False)[0:3]
print(df_sort)
